<?php
require("../config.php");

echo " <h1>Задачі: 19, 20, 21<br></h1>";

// 19. Знайти та вивести таблицю зведення числа 2 до ступеню 1..10.
echo "<h2><br>19. Таблиця зведення числа 2 до ступеню 1..10:<br></h2>";
for ($i = 1; $i <= 10; $i++) {
    $result = pow(2, $i);
    echo "2 в ступені $i = $result<br>";
}

// 20. Знайти та вивести на екран суму натуральних чисел, кратних 5, в діапазоні від 500 до 1000.
$start = 500;
$end = 1000;
$sum = 0;
for ($i = $start; $i <= $end; $i++) {
    if ($i % 5 == 0) {
        $sum += $i;
    }
}
echo "<h2><br>20. Сума натуральних чисел, кратних 5, в діапазоні від $start до $end: $sum<br></h2>";

// 21. Дано натуральне число N=200. Одержати найбільше число 4^n < N, де n - натуральне число.
$N = 200;
$n = log($N, 4);
$max_number = floor($n);

echo "<h2><br>21. Найбільше число 4^n < N, де n - натуральне число для N=$N: $max_number<br></h2>";
?>
